{
  
    "Agora": {
      "Name": "Agora",
      "Description": "Agora",
      "PhotoRoute": ["../agoraimages/creacioncuenta.gif", "../agoraimages/Pestana-Planes.gif", "../agoraimages/Pestana-Perfil.gif","../agoraimages/ChatMensajes.gif"],
         "PhotoText": [
        "The objective of Ágora is to have an application where you can make plans with people who have similar interests to yours. The application proposes plans created by other users that you can accept or reject according to your interests. Ágora offers an alternative to the superficiality of default dating applications. The plans are a means or excuse for an end, which is to meet people based on their interests. <br><br>Ágora was the final degree project for the Development of Multiplatform Applications.</br>",
        "Ágora is an application created in Android Studio. It consists of a registration and login screen and a ViewPager with four tabs: Plans, Create Plans, Profile, and Chat.", 
        "The conclusion of the application development and what was learned is the complexity of having a good, clear, and clean organization.", 
        "If you want to see more about the project, click on the button below to download the presentation <br><br><a download='Agora(English)' href='../agoraimages/Agora(English).pptx' target='blank'><i class='fabs fa-solid fa-file-arrow-down'></i></a>"
       ],
      "Lenguaje": "Java",
      "Framework": "Android Studio",
      "Type": "Social Network"
    },
    "Minesweeper": {
      "Name": "Minesweeper",
      "Description": "Minesweeper",
      "PhotoRoute": ["../minesweeperimages/mine1.png", "../minesweeperimages/mine2.png", "../minesweeperimages/mine3.png","../minesweeperimages/mine4.gif"],
      "PhotoText": [
        "I developed an Android Studio project that resembles the classic game Minesweeper. Players can select from three difficulty levels, including Easy, Medium, and Hard, each with a different number of boxes. The objective of the game is to uncover all the boxes without bombs to win.",
        "To increase the game's excitement, I added a timer feature that allows players to compete with themselves. The faster they uncover all the boxes, the higher their score will be.", 
        "The project includes concepts such as user interface management, event programming, algorithm implementation, and data management, among others..", 
        "<a href='https://github.com/Salexmineralex/Minesweeper' target='blank'><i class=' fabs fa-brands fa-github'></i></a>"
       ],
      "Lenguaje": "Java",
      "Framework": "Android Studio",
      "Type": "Game"
    },
    "FTP": {
      "Name": "FTP",
      "Description": "FTP",
      "PhotoRoute": ["../ftpimages/ftp1.png", "../ftpimages/ftp2.png", "../ftpimages/ftp3.png"],
      "PhotoText": [
       "FTP is a project created in Swing with Java, it is an FTP server to download files and upload them to a selected folder, the server is encrypted both symmetrically and asymmetrically.",
       "From the server we choose the folder we want to start sharing, and from the client we can upload and download files.", 
       "<a href='https://github.com/Salexmineralex/TCP_FTP_Encrypted' target='blank'><i class=' fabs fa-brands fa-github'></i></a>"
      ],
      "Lenguaje": "Java",
      "Framework": "Swing",
      "Type": "FTP Server and Client"
    },
    "Pokeapairs": {
      "Name": "Pokeapairs",
      "Description": "Pokeapairs",
      "PhotoRoute": ["../pokeparisimages/poke1.png", "../pokeparisimages/poke2.png", "../pokeparisimages/poke3.png", "../pokeparisimages/poke4.gif"],
      "PhotoText": [
        "I developed an Android Studio application that features a Pairs game with a Pokemon theme.",
        "The game allows users to select from three difficulty levels, each with varying numbers of boxes.",
        "The objective of the game is to uncover pairs of matching figures, which remain visible once discovered.",
        "<a href='https://github.com/Salexmineralex/PokePairs' target='blank'><i class=' fabs fa-brands fa-github'></i></a>"
       ],
      "Lenguaje": "Java",
      "Framework": "Android Studio",
      "Type": "Game"
    },
    "SQLITE": {
      "Name": "SQLITE",
      "Description": "SQLITE",
      "PhotoRoute": ["../sqliteimages/sqlite1.png", "../sqliteimages/sqlite2.png", "../sqliteimages/sqlite3.png","../sqliteimages/sqlite4.png","../sqliteimages/sqlite5.png","../sqliteimages/sqlite6.gif"],
      "PhotoText": [
        "I developed an Android Studio application that utilizes a local SQLITE database, user account creation and login system, and the ability to add movies to the database.",
        "One of the challenges I encountered while developing this application was implementing the trailer search feature.",
        "The project showcases my proficiency in mobile app development, database management, and user experience design.", 
        "The application's user interface is user-friendly, making it easy for users to navigate the different features.", 
        "The application also includes a puzzle game using the movie poster and a trailer search feature.", 
        "<a href='https://github.com/Salexmineralex/Films_SQLITE' target='blank'><i class=' fabs fa-brands fa-github'></i></a>"
       ],
      "Lenguaje": "Java",
      "Framework": "Android Studio",
      "Type": "Database Application"
    },
    "SFML": {
      "Name": "Space Invaders",
      "Description": "SFML",
      "PhotoRoute": ["../sfmlimages/sfml1.png", "../sfmlimages/sfml2.png", "../sfmlimages/sfml3.png","../sfmlimages/sfml4.gif"],
      "PhotoText": [
        "This project is a modified version of Space Invaders with waves, an exponential difficulty increase, and a life bar instead of three lives, instead of having three lives like the original game, the player has a life bar that decreases as enemies hit them. Once the health reaches zero, a GameOver screen appears.",
        "The 'Main' section contains a while loop that continues running as long as the game is not closed. The 'Game' section initializes all subsystems and executes the update method, which handles the game's logic, drawing, and screen clearing.",
        "The controls are simple, with the arrow keys used to move the spaceship, spacebar to shoot, 'R' to restart the game, and 'Escape' to exit.", 
        "<a href='https://github.com/Salexmineralex/SFML_SpaceInvaderClone' target='blank'><i class=' fabs fa-brands fa-github'></i></a>"
       ],
      "Lenguaje": "C++",
      "Framework": "SFML",
      "Type": "Videogame"
    }
  }